'use strict';


const articlesMock = [{
  "id": `a3Mvqf`,
  "title": `Как собрать камни бесконечности`,
  "createdDate": `2020-8-23 0:00:00`,
  "announce": `Игры и программирование разные вещи. Не стоит идти в программисты если вам нравится только игры.Как начать действовать? Для начала просто соберитесь.Первая большая ёлка была установлена только в 1938 году.Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.`,
  "fullText": `Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.Из под его пера вышло 8 платиновых альбомов.Помните небольшое количество ежедневных упражнений лучше чем один раз но много.Ёлки — это не просто красивое дерево. Это прочная древесина.Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле?Ёлки — это не просто красивое дерево. Это прочная древесина.Это один из лучших рок-музыкантов.Собрать камни бесконечности легко если вы прирожденный герой.Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем.Из под его пера вышло 8 платиновых альбомов.Как начать действовать? Для начала просто соберитесь.Это один из лучших рок-музыкантов.Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать.Как начать действовать? Для начала просто соберитесь.`,
  "category": `IT`,
  "comments": [{
    "id": `n5YD49`,
    "text": `Почему в таком ужасном состоянии? А сколько игр в комплекте? А где блок питания?`
  }, {
    "id": `fz76m3`,
    "text": `А сколько игр в комплекте?`
  }, {
    "id": `h93nk6`,
    "text": `А где блок питания? Совсем немного... С чем связана продажа? Почему так дешёво?`
  }, {
    "id": `c2Z60U`,
    "text": `С чем связана продажа? Почему так дешёво? Вы что?! В магазине дешевле.`
  }]
}, {
  "id": `Fg3szY`,
  "title": `Как достигнуть успеха не вставая с кресла`,
  "createdDate": `2020-10-1 0:00:00`,
  "announce": `Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем.Игры и программирование разные вещи. Не стоит идти в программисты если вам нравится только игры.Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем.Игры и программирование разные вещи. Не стоит идти в программисты если вам нравится только игры.Ёлки — это не просто красивое дерево. Это прочная древесина.`,
  "fullText": `Он написал больше 30 хитов.Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.Достичь успеха помогут ежедневные повторения.undefinedСобрать камни бесконечности легко если вы прирожденный герой.Первая большая ёлка была установлена только в 1938 году.Простые ежедневные упражнения помогут достичь успеха.undefinedКак начать действовать? Для начала просто соберитесь.Достичь успеха помогут ежедневные повторения.Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать.`,
  "category": `Кино`,
  "comments": [{
    "id": `zcMcsX`,
    "text": `А где блок питания? Оплата наличными или перевод на карту?`
  },
  {
    "id": `c2Z60U`,
    "text": `С чем связана продажа? Почему так дешёво? Вы что?! В магазине дешевле.`
  },
  ]
},
{
  "id": `mRsziN`,
  "title": `Как достигнуть успеха не вставая с кресла`,
  "createdDate": `2020-8-22 0:00:00`,
  "announce": `Из под его пера вышло 8 платиновых альбомов.Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем.Достичь успеха помогут ежедневные повторения.`,
  "fullText": `Из под его пера вышло 8 платиновых альбомов.Как начать действовать? Для начала просто соберитесь.Это один из лучших рок-музыкантов.Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем.Собрать камни бесконечности легко если вы прирожденный герой.Помните небольшое количество ежедневных упражнений лучше чем один раз но много.Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле?Достичь успеха помогут ежедневные повторения.Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать.Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике.Простые ежедневные упражнения помогут достичь успеха.`,
  "category": `Без рамки`,
  "comments": [
    {
      "id": `WGYJ1b`,
      "text": `А где блок питания? Вы что?! В магазине дешевле.`
    },
    {
      "id": `2kOGeX`,
      "text": `Оплата наличными или перевод на карту?`
    },
    {
      "id": `nh_Jf0`,
      "name": `sample`,
      "time": `Wed, 21 Oct 2015 18:27:50 GMT`
    },
    {
      "id": `Me_JK1`,
      "name": `sample`,
      "time": `Wed, 21 Oct 2015 18:27:50 GMT`
    }
  ]
}
];

module.exports = articlesMock;
